# An Introduction to Pandas

Today's talk consists of 3 components:
* A 15 minute introduction to the basics of pandas (Kevin)
* Using pandas to conduct time series modeling (Shiman)
* Using Pandas for portfolio optimization/financial engineering using Quantopian (Carlos)

Reference: 
* Pandas Documentation: http://pandas.pydata.org/pandas-docs/version/0.15.1/10min.html#min
* Wes McKinney's Tutorial:  https://github.com/estimate/pandas-exercises
* Pandas for Time Series Analysis: http://nbviewer.ipython.org/github/changhiskhan/talks/blob/master/pydata2012/pandas_timeseries.ipynb
* Quantopian.com: https://www.quantopian.com/lectures

In [1]:
#----------- Importing Packages ---------------#
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Object Creation
Let's create a series by passing a list of values, and let pandas create a default integer index. 

Recall that: a series is a one-dimensional labeled array capable of holding any data type

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0     1
1     3
2     5
3   NaN
4     6
5     8
dtype: float64

We can also create a DataFrame by passing a numpt array with a datetime index and labeled columns

In [4]:
dates = pd.date_range('20130101',periods=6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))

In [7]:
df

                   A         B         C         D
2013-01-01  0.115415  0.986243  1.069812 -1.593238
2013-01-02 -1.781998  0.103136  0.922758 -0.007165
2013-01-03 -1.157740  0.062608 -0.043764 -0.237937
2013-01-04 -0.483409 -0.267191 -1.710547  0.803977
2013-01-05 -1.004736  1.379636  1.829796  1.428731
2013-01-06 -1.579093 -1.789174  0.615581  1.555265

We can also create a DataFrame by passing a dictionary of objects that can be convereted to series-like

In [8]:
df2 = pd.DataFrame({ 'A' : 1.,
   ....:                      'B' : pd.Timestamp('20130102'),
   ....:                      'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
   ....:                      'D' : np.array([3] * 4,dtype='int32'),
   ....:                      'E' : pd.Categorical(["test","train","test","train"]),
   ....:                      'F' : 'foo' })

In [9]:
df2

   A          B  C  D      E    F
0  1 2013-01-02  1  3   test  foo
1  1 2013-01-02  1  3  train  foo
2  1 2013-01-02  1  3   test  foo
3  1 2013-01-02  1  3  train  foo

In [10]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

If you’re using IPython, tab completion for column names (as well as public attributes) is automatically enabled. Here’s a subset of the attributes that will be completed:

In [ ]:
df2.

# Viewing Data

In [11]:
# See the top of the dataframe
df.head()

                   A         B         C         D
2013-01-01  0.115415  0.986243  1.069812 -1.593238
2013-01-02 -1.781998  0.103136  0.922758 -0.007165
2013-01-03 -1.157740  0.062608 -0.043764 -0.237937
2013-01-04 -0.483409 -0.267191 -1.710547  0.803977
2013-01-05 -1.004736  1.379636  1.829796  1.428731

In [12]:
df.head(1)

                   A         B         C         D
2013-01-01  0.115415  0.986243  1.069812 -1.593238

In [13]:
# See the bottom of the dataframe
df.tail(3)

                   A         B         C         D
2013-01-04 -0.483409 -0.267191 -1.710547  0.803977
2013-01-05 -1.004736  1.379636  1.829796  1.428731
2013-01-06 -1.579093 -1.789174  0.615581  1.555265

In [14]:
#Display the index,columns, and the underlying numpy data
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
df.values

array([[ 0.11541527,  0.98624318,  1.06981242, -1.59323768],
       [-1.78199754,  0.10313564,  0.92275844, -0.00716533],
       [-1.15774033,  0.06260756, -0.04376445, -0.23793711],
       [-0.48340914, -0.26719146, -1.71054727,  0.80397678],
       [-1.00473567,  1.37963602,  1.82979593,  1.42873099],
       [-1.57909262, -1.78917397,  0.61558072,  1.55526537]])

In [17]:
# the command Describe shows a quick summary of your data (just like summary() in R)
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.981927  0.079209  0.447273  0.324939
std    0.704391  1.106844  1.220708  1.188954
min   -1.781998 -1.789174 -1.710547 -1.593238
25%   -1.473755 -0.184742  0.121072 -0.180244
50%   -1.081238  0.082872  0.769170  0.398406
75%   -0.613741  0.765466  1.033049  1.272542
max    0.115415  1.379636  1.829796  1.555265

In [18]:
# Transposing Data!!!
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.115415   -1.781998   -1.157740   -0.483409   -1.004736   -1.579093
B    0.986243    0.103136    0.062608   -0.267191    1.379636   -1.789174
C    1.069812    0.922758   -0.043764   -1.710547    1.829796    0.615581
D   -1.593238   -0.007165   -0.237937    0.803977    1.428731    1.555265

In [19]:
#sorting by an axis
df.sort_index(axis=1, ascending = True)

                   A         B         C         D
2013-01-01  0.115415  0.986243  1.069812 -1.593238
2013-01-02 -1.781998  0.103136  0.922758 -0.007165
2013-01-03 -1.157740  0.062608 -0.043764 -0.237937
2013-01-04 -0.483409 -0.267191 -1.710547  0.803977
2013-01-05 -1.004736  1.379636  1.829796  1.428731
2013-01-06 -1.579093 -1.789174  0.615581  1.555265

In [20]:
#sorting by an axis #2
df.sort_index(axis=1, ascending = False)

                   D         C         B         A
2013-01-01 -1.593238  1.069812  0.986243  0.115415
2013-01-02 -0.007165  0.922758  0.103136 -1.781998
2013-01-03 -0.237937 -0.043764  0.062608 -1.157740
2013-01-04  0.803977 -1.710547 -0.267191 -0.483409
2013-01-05  1.428731  1.829796  1.379636 -1.004736
2013-01-06  1.555265  0.615581 -1.789174 -1.579093

In [21]:
#sorting by values
df.sort(columns='B') #deprecated from Python 2.7

//anaconda/lib/python3.5/site-packages/ipykernel/__main__.py:2: FutureWarning: sort(columns=....) is deprecated, use sort_values(by=.....)
  from ipykernel import kernelapp as app

                   A         B         C         D
2013-01-06 -1.579093 -1.789174  0.615581  1.555265
2013-01-04 -0.483409 -0.267191 -1.710547  0.803977
2013-01-03 -1.157740  0.062608 -0.043764 -0.237937
2013-01-02 -1.781998  0.103136  0.922758 -0.007165
2013-01-01  0.115415  0.986243  1.069812 -1.593238
2013-01-05 -1.004736  1.379636  1.829796  1.428731

In [22]:
df.sort_values('B') #Python 3.5

                   A         B         C         D
2013-01-06 -1.579093 -1.789174  0.615581  1.555265
2013-01-04 -0.483409 -0.267191 -1.710547  0.803977
2013-01-03 -1.157740  0.062608 -0.043764 -0.237937
2013-01-02 -1.781998  0.103136  0.922758 -0.007165
2013-01-01  0.115415  0.986243  1.069812 -1.593238
2013-01-05 -1.004736  1.379636  1.829796  1.428731

# Selection

for production code, it is recommend that one uses the optimized pandas data access methods, .at, .iat, .loc, .iloc and .ix.

## Getting

In [23]:
# Selecting a single column, which yields a Series
df['A']

2013-01-01    0.115415
2013-01-02   -1.781998
2013-01-03   -1.157740
2013-01-04   -0.483409
2013-01-05   -1.004736
2013-01-06   -1.579093
Freq: D, Name: A, dtype: float64

In [24]:
# Selecting via [], which slices the rows
df[0:3]

                   A         B         C         D
2013-01-01  0.115415  0.986243  1.069812 -1.593238
2013-01-02 -1.781998  0.103136  0.922758 -0.007165
2013-01-03 -1.157740  0.062608 -0.043764 -0.237937

In [25]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -1.781998  0.103136  0.922758 -0.007165
2013-01-03 -1.157740  0.062608 -0.043764 -0.237937
2013-01-04 -0.483409 -0.267191 -1.710547  0.803977

# Selection by Label

In [ ]:
df.loc?

In [26]:
df.loc[dates[0]]

A    0.115415
B    0.986243
C    1.069812
D   -1.593238
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.115415  0.986243
2013-01-02 -1.781998  0.103136
2013-01-03 -1.157740  0.062608
2013-01-04 -0.483409 -0.267191
2013-01-05 -1.004736  1.379636
2013-01-06 -1.579093 -1.789174

In [28]:
df.loc[dates[0:3],['A', 'B']]

                   A         B
2013-01-01  0.115415  0.986243
2013-01-02 -1.781998  0.103136
2013-01-03 -1.157740  0.062608

In [29]:
df.loc['20130102':'20130104',['A', 'B']]

                   A         B
2013-01-02 -1.781998  0.103136
2013-01-03 -1.157740  0.062608
2013-01-04 -0.483409 -0.267191

In [30]:
df.loc[dates[0],'A']

0.11541526628408223

In [31]:
df.at[dates[0], 'A']

0.11541526628408223

# Selection by Position

In [32]:
# Select via the position of the passed integers
df.iloc[3]

A   -0.483409
B   -0.267191
C   -1.710547
D    0.803977
Name: 2013-01-04 00:00:00, dtype: float64

In [33]:
# By integer slices, acting simiilar to numpy/python
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.483409 -0.267191
2013-01-05 -1.004736  1.379636

In [34]:
# By lists of integer position locations, similar to the numpy/python style
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.986243  1.069812
2013-01-02  0.103136  0.922758
2013-01-03  0.062608 -0.043764
2013-01-04 -0.267191 -1.710547
2013-01-05  1.379636  1.829796
2013-01-06 -1.789174  0.615581

In [35]:
# For slicing rows explicitly
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -1.781998  0.103136  0.922758 -0.007165
2013-01-03 -1.157740  0.062608 -0.043764 -0.237937

In [36]:
# For slicing columns explicitly
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.986243  1.069812
2013-01-02  0.103136  0.922758
2013-01-03  0.062608 -0.043764
2013-01-04 -0.267191 -1.710547
2013-01-05  1.379636  1.829796
2013-01-06 -1.789174  0.615581

In [37]:
# For getting a value explicitly
df.iloc[1,1]

0.10313563657888485

In [ ]:
df.iat[1,1]

In [ ]:
df.iat?

# Boolean Indexing

In [38]:
# Using a single column's value to select data
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.115415  0.986243  1.069812 -1.593238

In [39]:
# Where Operation
df[df >0]

                   A         B         C         D
2013-01-01  0.115415  0.986243  1.069812       NaN
2013-01-02       NaN  0.103136  0.922758       NaN
2013-01-03       NaN  0.062608       NaN       NaN
2013-01-04       NaN       NaN       NaN  0.803977
2013-01-05       NaN  1.379636  1.829796  1.428731
2013-01-06       NaN       NaN  0.615581  1.555265

In [40]:
df2 = df.copy()

In [41]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [42]:
df2

                   A         B         C         D      E
2013-01-01  0.115415  0.986243  1.069812 -1.593238    one
2013-01-02 -1.781998  0.103136  0.922758 -0.007165    one
2013-01-03 -1.157740  0.062608 -0.043764 -0.237937    two
2013-01-04 -0.483409 -0.267191 -1.710547  0.803977  three
2013-01-05 -1.004736  1.379636  1.829796  1.428731   four
2013-01-06 -1.579093 -1.789174  0.615581  1.555265  three

In [43]:
# Using the isin() method for filtering
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -1.157740  0.062608 -0.043764 -0.237937   two
2013-01-05 -1.004736  1.379636  1.829796  1.428731  four

# Setting

In [44]:
# Setting a new column automatically aligns the data by the indexes
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [45]:
df['F']= s1

In [46]:
df

                   A         B         C         D   F
2013-01-01  0.115415  0.986243  1.069812 -1.593238 NaN
2013-01-02 -1.781998  0.103136  0.922758 -0.007165   1
2013-01-03 -1.157740  0.062608 -0.043764 -0.237937   2
2013-01-04 -0.483409 -0.267191 -1.710547  0.803977   3
2013-01-05 -1.004736  1.379636  1.829796  1.428731   4
2013-01-06 -1.579093 -1.789174  0.615581  1.555265   5

In [47]:
# Setting values by label
df.at[dates[0], 'A'] = 0

In [48]:
df

                   A         B         C         D   F
2013-01-01  0.000000  0.986243  1.069812 -1.593238 NaN
2013-01-02 -1.781998  0.103136  0.922758 -0.007165   1
2013-01-03 -1.157740  0.062608 -0.043764 -0.237937   2
2013-01-04 -0.483409 -0.267191 -1.710547  0.803977   3
2013-01-05 -1.004736  1.379636  1.829796  1.428731   4
2013-01-06 -1.579093 -1.789174  0.615581  1.555265   5

In [49]:
# Setting values by position
df.iat[0,1]=0
df

                   A         B         C         D   F
2013-01-01  0.000000  0.000000  1.069812 -1.593238 NaN
2013-01-02 -1.781998  0.103136  0.922758 -0.007165   1
2013-01-03 -1.157740  0.062608 -0.043764 -0.237937   2
2013-01-04 -0.483409 -0.267191 -1.710547  0.803977   3
2013-01-05 -1.004736  1.379636  1.829796  1.428731   4
2013-01-06 -1.579093 -1.789174  0.615581  1.555265   5

In [50]:
#Setting by assigning with a numpy array
df.loc[:, 'D'] = np.array([5]*len(df))
df

                   A         B         C  D   F
2013-01-01  0.000000  0.000000  1.069812  5 NaN
2013-01-02 -1.781998  0.103136  0.922758  5   1
2013-01-03 -1.157740  0.062608 -0.043764  5   2
2013-01-04 -0.483409 -0.267191 -1.710547  5   3
2013-01-05 -1.004736  1.379636  1.829796  5   4
2013-01-06 -1.579093 -1.789174  0.615581  5   5

In [51]:
df2 = df.copy()

In [53]:
df2[df2 >0] = -df2

# Missing Data
pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations.

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

In [54]:
df

                   A         B         C  D   F
2013-01-01  0.000000  0.000000  1.069812  5 NaN
2013-01-02 -1.781998  0.103136  0.922758  5   1
2013-01-03 -1.157740  0.062608 -0.043764  5   2
2013-01-04 -0.483409 -0.267191 -1.710547  5   3
2013-01-05 -1.004736  1.379636  1.829796  5   4
2013-01-06 -1.579093 -1.789174  0.615581  5   5

In [55]:
df1 = df.reindex(index=dates[0:4],columns=list(df.columns)+['E'])

In [56]:
df1

                   A         B         C  D   F   E
2013-01-01  0.000000  0.000000  1.069812  5 NaN NaN
2013-01-02 -1.781998  0.103136  0.922758  5   1 NaN
2013-01-03 -1.157740  0.062608 -0.043764  5   2 NaN
2013-01-04 -0.483409 -0.267191 -1.710547  5   3 NaN

In [57]:
df1.loc[dates[0]:dates[1], 'E']=1
df1

                   A         B         C  D   F   E
2013-01-01  0.000000  0.000000  1.069812  5 NaN   1
2013-01-02 -1.781998  0.103136  0.922758  5   1   1
2013-01-03 -1.157740  0.062608 -0.043764  5   2 NaN
2013-01-04 -0.483409 -0.267191 -1.710547  5   3 NaN

In [59]:
# drop any rows that have missing data
df1.dropna(how='any')

                   A         B         C  D  F  E
2013-01-02 -1.781998  0.103136  0.922758  5  1  1

In [60]:
# filling in for missing data
df1.fillna(value=5)

                   A         B         C  D  F  E
2013-01-01  0.000000  0.000000  1.069812  5  5  1
2013-01-02 -1.781998  0.103136  0.922758  5  1  1
2013-01-03 -1.157740  0.062608 -0.043764  5  2  5
2013-01-04 -0.483409 -0.267191 -1.710547  5  3  5

In [61]:
# To get the boolean mask where values are nan
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# Operations

## Stats

In [62]:
# Performing a descriptive statistics
df.mean()

A   -1.001163
B   -0.085164
C    0.447273
D    5.000000
F    3.000000
dtype: float64

In [63]:
# Same operations on the other axis
df.mean(1)

2013-01-01    1.517453
2013-01-02    1.048779
2013-01-03    1.172221
2013-01-04    1.107770
2013-01-05    2.240939
2013-01-06    1.449463
Freq: D, dtype: float64

In [64]:
# Operating with objects that have different dimensionality and need alignment 
# Broadcasting in pandas!
s = pd.Series([1,3,5,np.nan, 6, 8],index=dates).shift(2)
s

2013-01-01   NaN
2013-01-02   NaN
2013-01-03     1
2013-01-04     3
2013-01-05     5
2013-01-06   NaN
Freq: D, dtype: float64

In [ ]:
df

In [65]:
#Subtraction of dataframe and other, element-wise (binary operator `sub`)
df.sub(s,axis='index')

                   A         B         C   D   F
2013-01-01       NaN       NaN       NaN NaN NaN
2013-01-02       NaN       NaN       NaN NaN NaN
2013-01-03 -2.157740 -0.937392 -1.043764   4   1
2013-01-04 -3.483409 -3.267191 -4.710547   2   0
2013-01-05 -6.004736 -3.620364 -3.170204   0  -1
2013-01-06       NaN       NaN       NaN NaN NaN

In [67]:
df

                   A         B         C  D   F
2013-01-01  0.000000  0.000000  1.069812  5 NaN
2013-01-02 -1.781998  0.103136  0.922758  5   1
2013-01-03 -1.157740  0.062608 -0.043764  5   2
2013-01-04 -0.483409 -0.267191 -1.710547  5   3
2013-01-05 -1.004736  1.379636  1.829796  5   4
2013-01-06 -1.579093 -1.789174  0.615581  5   5

# Apply
Applying functions to data!

In [66]:
df.apply(np.cumsum)

                   A         B         C   D   F
2013-01-01  0.000000  0.000000  1.069812   5 NaN
2013-01-02 -1.781998  0.103136  1.992571  10   1
2013-01-03 -2.939738  0.165743  1.948806  15   3
2013-01-04 -3.423147 -0.101448  0.238259  20   6
2013-01-05 -4.427883  1.278188  2.068055  25  10
2013-01-06 -6.006975 -0.510986  2.683636  30  15

In [ ]:
df

In [68]:
df.apply(lambda x: x.max() - x.min())

A    1.781998
B    3.168810
C    3.540343
D    0.000000
F    4.000000
dtype: float64

In [69]:
df.apply(lambda x: x.max() - x.min(),axis = 1)

2013-01-01    5.000000
2013-01-02    6.781998
2013-01-03    6.157740
2013-01-04    6.710547
2013-01-05    6.004736
2013-01-06    6.789174
Freq: D, dtype: float64

## Histogramming

In [70]:
s = pd.Series(np.random.randint(0,7,size=10))
s

0    3
1    4
2    4
3    6
4    2
5    0
6    0
7    1
8    5
9    2
dtype: int64

In [71]:
s.value_counts()

4    2
2    2
0    2
6    1
5    1
3    1
1    1
dtype: int64

## String Methods
Series is equipped with a set of string processng methods in the str attribute that make it easy to operate on each element of the array, as in the code snipped below. Note that pattern-matching in str generally uses regular expressions by default (and in some cases always uses them).

In [73]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [74]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# Merge

## concat
pandas provides facilities for easily combining together Series, DataFrame, and Panel Objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join/merge-type operations

In [75]:
# Concatenating pandas objects together
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0  0.358887 -0.874352  1.003608  0.294463
1 -1.388220  1.911727 -1.222104 -1.611011
2 -0.592141 -1.187489  0.239860  0.748122
3 -2.016131 -0.247131 -0.611336  0.933676
4 -1.444609  0.929760  2.208793  1.343260
5  0.695877  1.209131  0.529779 -0.876144
6 -1.331947  0.547563 -0.160236  1.509900
7 -0.613939  0.368541  1.591557 -1.672693
8  1.513213  2.762840 -0.088075  1.548342
9  0.059689  1.925167  1.807202  1.101697

In [76]:
pieces = [df[:3], df[3:7], df[7:]]

In [78]:
pieces

[          0         1         2         3
 0  0.358887 -0.874352  1.003608  0.294463
 1 -1.388220  1.911727 -1.222104 -1.611011
 2 -0.592141 -1.187489  0.239860  0.748122,
           0         1         2         3
 3 -2.016131 -0.247131 -0.611336  0.933676
 4 -1.444609  0.929760  2.208793  1.343260
 5  0.695877  1.209131  0.529779 -0.876144
 6 -1.331947  0.547563 -0.160236  1.509900,
           0         1         2         3
 7 -0.613939  0.368541  1.591557 -1.672693
 8  1.513213  2.762840 -0.088075  1.548342
 9  0.059689  1.925167  1.807202  1.101697]

In [79]:
df[:3]

          0         1         2         3
0  0.358887 -0.874352  1.003608  0.294463
1 -1.388220  1.911727 -1.222104 -1.611011
2 -0.592141 -1.187489  0.239860  0.748122

In [80]:
pd.concat(pieces)

          0         1         2         3
0  0.358887 -0.874352  1.003608  0.294463
1 -1.388220  1.911727 -1.222104 -1.611011
2 -0.592141 -1.187489  0.239860  0.748122
3 -2.016131 -0.247131 -0.611336  0.933676
4 -1.444609  0.929760  2.208793  1.343260
5  0.695877  1.209131  0.529779 -0.876144
6 -1.331947  0.547563 -0.160236  1.509900
7 -0.613939  0.368541  1.591557 -1.672693
8  1.513213  2.762840 -0.088075  1.548342
9  0.059689  1.925167  1.807202  1.101697

# Join
SQL style merges! Yay!?

In [81]:
left = pd.DataFrame({'key':['foo', 'foo'], 'lval':[1,2]})

In [82]:
left

   key  lval
0  foo     1
1  foo     2

In [83]:
right = pd.DataFrame({'key':['foo','foo'], 'rval':[4,5]})

In [84]:
right

   key  rval
0  foo     4
1  foo     5

In [85]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [86]:
pd.merge(right, left, on='key')

   key  rval  lval
0  foo     4     1
1  foo     4     2
2  foo     5     1
3  foo     5     2

## Append

In [87]:
# Append rows to a dataframe
df = pd.DataFrame(np.random.randn(8,4), columns=['A','B', 'C', 'D'])
df

          A         B         C         D
0  1.416376 -1.578869 -0.745235  0.793055
1  0.351525 -1.314610 -0.904497 -0.433119
2 -0.603140  0.350503 -0.799446  0.565579
3  0.887248 -1.393852  0.929793  2.210884
4 -1.344912  0.157509 -0.812964 -0.592346
5  1.050144  0.353963 -1.029676  0.071252
6 -1.984297 -1.475679 -0.713735  1.988794
7 -1.231604 -1.158271 -1.100143  1.970062

In [88]:
s = df.iloc[3]
s

A    0.887248
B   -1.393852
C    0.929793
D    2.210884
Name: 3, dtype: float64

In [89]:
df.append(s, ignore_index =True)

          A         B         C         D
0  1.416376 -1.578869 -0.745235  0.793055
1  0.351525 -1.314610 -0.904497 -0.433119
2 -0.603140  0.350503 -0.799446  0.565579
3  0.887248 -1.393852  0.929793  2.210884
4 -1.344912  0.157509 -0.812964 -0.592346
5  1.050144  0.353963 -1.029676  0.071252
6 -1.984297 -1.475679 -0.713735  1.988794
7 -1.231604 -1.158271 -1.100143  1.970062
8  0.887248 -1.393852  0.929793  2.210884

## Groupby
By "group by", pandas is referring to a process involving one or more of the following steps:
* Splitting the data into groups based on some criteria
* Applying a function to each group independently
* Combining the results into a data structure

In [90]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',  'foo', 'bar', 'foo', 'foo'],
                  'B': ['one', 'two', 'three', 'two', 'two', 'two', 'one', 'three'],
                  'C': np.random.randn(8), 
                  'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one  1.673063  1.365457
1  bar    two -0.904069 -0.262294
2  foo  three -1.294107 -1.048957
3  bar    two -0.205480 -0.963977
4  foo    two  0.988980  1.780797
5  bar    two  1.328225  1.283319
6  foo    one  0.884304 -1.597692
7  foo  three -1.021933 -2.217538

In [91]:
# Grouping then summing the resulting groups
df.groupby('A').sum()

            C         D
A
bar  0.218676  0.057048
foo  1.230305 -1.717931

In [ ]:
# Grouping by multiple columns forms a hierarchical index, which allows us to then apply the function
df.groupby(['A', 'B']).mean()

# Reshaping

## Stack

In [92]:
#zip(iter1 [,iter2 [...]]) --> zip object
#Return a zip object whose .__next__() method returns a tuple where
#the i-th element comes from the i-th iterable argument.  The .__next__()
#method continues until the shortest iterable in the argument sequence
#is exhausted and then it raises StopIteration.
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz', 'foo', 'fo', 'qux', 'qux'],
                   ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('fo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [ ]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

In [ ]:
df = pd.DataFrame(np.random.randn(8,2), index = index, columns = ['A', 'B'])
df

In [ ]:
df2 = df[:4]
df2

In [ ]:
df3 = df[:7]
df3

The stack function "compresses" a level in the DataFrame's columns; the opposite/inverse operation is unstack (which by default unstacks the last level)

In [ ]:
stacked = df2.stack()
stacked

In [ ]:
stacked.unstack()

In [ ]:
stacked.unstack(1)

In [ ]:
stacked.unstack(0)

## Pivot Tables

In [ ]:
df = pd.DataFrame({'A':['one', 'one', 'two', 'three']*3,
                  'B': ['A', 'B', 'C']*4,
                  'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar']*2,
                  'D': np.random.randn(12),
                  'E': np.random.randn(12)})
df

In [ ]:
pd.pivot_table(df, values = 'D', index = ['A', 'B'], columns = ['C'])

## Time Series
Pandas has simple, powerful, and efficient functionality for performing resampling operations during frequency conversion (e.g., converting secondly data into 5-minutely data). This is extremely common in, but not limtied to, financial applications. 
Shiman will go into details in the next section.

In [ ]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

In [ ]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [ ]:
ts.resample('5Min', how='sum')

In [ ]:
# Time Zone Representation
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')

In [ ]:
ts = pd.Series(np.random.randn(len(rng)), rng)

In [ ]:
ts

In [ ]:
ts_utc = ts.tz_localize('UTC')

In [ ]:
ts_utc

In [ ]:
# Convert to another time zone
ts_utc.tz_convert('US/Eastern')

In [ ]:
# Converting between time span representations
rng = pd.date_range('1/1/2012', periods=5, freq='M')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

In [ ]:
ps = ts.to_period()
ps

In [ ]:
ps.to_timestamp()

Converting between period and timestamp enables some convenient arithmetic functions to be used. In the following example, we convert a quarterly frequency with year ending in November to 9am of the end of the month following the quarter end:

In [ ]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')
ts = pd.Series(np.random.randn(len(prng)), prng)
ts.index = (prng.asfreq('M', 'e')+1).asfreq('H', 's') + 9
ts.head()

In [ ]:
prng

# Categoricals
pandas can now handle categorical data in DataFrame.

In [ ]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})
df

In [ ]:
# Convert the raw grades to a categorical data type
df["grade"] = df["raw_grade"].astype("category")
df["grade"]

In [ ]:
# Rename the categories to more meaningful names (assigning to Series.cat.categories is inplace!)
df["grade"].cat.categories = ["very good", "good", "very bad"]

In [ ]:
df

In [ ]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])
df["grade"]

In [ ]:
df.sort_values("grade")

In [ ]:
df.groupby("grade").size()

# Plotting

In [ ]:
%pylab inline

In [ ]:
# A Random Walk!
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))
ts = ts.cumsum()
ts.plot()

In [ ]:
# On DataFrame, plot is a convenience to plot all of the columns with labels:
df = pd.DataFrame(np.random.randn(1000, 4), index=ts.index,columns=['A', 'B', 'C', 'D'])

In [ ]:
df = df.cumsum()
plt.figure(); df.plot(); plt.legend(loc='best')

# Input/Output

## CSV

In [ ]:
df.to_csv('foo.csv')

In [ ]:
!ls

In [ ]:
!head foo.csv

In [ ]:
 pd.read_csv('foo.csv')

## HDF5

In [ ]:
df.to_hdf('foo.h5','df')

In [ ]:
!ls

In [ ]:
pd.read_hdf('foo.h5','df')